import {
  Box,
  Container,
  Item,
  List,
  Section,
  Subtitle,
  Title,
} from './AboutUsGoals.styled';

const AboutUsGoals = () => {
  return (
    <Section>
      <Container>
        <Title>Цілі, що творять зміни</Title>
        <Box>
          <Subtitle>
            Разом ми створюємо краще майбутнє для тварин, де кожен чотирилапий
            друг може знайти своє щасливе та безпечне місце під сонцем. Ми
            прагнемо до:
          </Subtitle>
          <List>
            <Item>Безпечної країни для тварин - створення країни, де відсутні безпритульні тварини. Ми віримо, що кожен хвостик заслуговує на теплий дім та безмежну любов.</Item>
            <Item>Культури відповідального ставлення - формування культури серед наших співвітчизників, яка визначатиметься відповідальністю та повагою до чотирилапих друзів. Разом із вами, ми виховуємо свідомих громадян, готових допомагати тим, хто потребує захисту.</Item>
            <Item>Тимчасового прихистку для тварин - зробити наш притулок тимчасовим домом, де кожна тварина відчуває тепло, захист та можливість знайти постійний господарський дім.</Item>
            <Item>Розповсюдження відповідальності - поширювати усвідомленість про відповідальне ставлення до тварин. Відповідальність несе кожен, і ми впевнені, що з вашою підтримкою ми зможемо досягти наших цілей.</Item>
          </List>
        </Box>
      </Container>
    </Section>
  );
};

export default AboutUsGoals;
