import sprite from '../../images/sprite.svg';
import {
  Box,
  Button,
  Container,
  FirstText,
  Image,
  Section,
  Text,
  Title,
} from './GrantLove.styled';

const GrantLove = () => {
  return (
    <Section>
      <Container>
        <Title>Даруй любов: Прихисти нового члена родини</Title>
        <Box>
          <FirstText>
            Любов безмежна, а найбільше вона сяє у тих митях, коли ти даруєш її
            іншій живій істоті. У нашому притулку ми віримо в те, що кожен має
            право на щасливе життя та відданого друга. Чекаючі на тебе – це
            безпритульні тварини, які готові до полноцінного життя у гарячо
            люблячому гніздечку.
          </FirstText>
          <FirstText>
            Запрошуємо тебе стати частиною цього чудового процесу – взяти додому
            нового друга, який готовий поділитися своєю радістю та вірністю.
            Наші підопічні готові стати членами твоєї родини, принести в дім
            радість та неповторні миті тепла.
          </FirstText>
          <Text>
            Прийди та знайди того, кого ти чекаєш. Адопція – це не лише акт
            любові, але і шлях до створення незабутніх спогадів. Разом ми можемо
            змінити життя, один лагідний погляд та щира посмішка назавжди
            залишаться у твоїй душі.
          </Text>
          <Button>Заповнити заявку</Button>
        </Box>
        <Image>
          <use href={`${sprite}#icon-dog-walking`}></use>
        </Image>
      </Container>
    </Section>
  );
};

export default GrantLove;
