import {
  Box,
  Container,
  SecondText,
  Section,
  Text,
  Title,
} from './AboutUsFamily.styled';

const AboutUsFamily = () => {
  return (
    <Section>
      <Container>
        <Title>Наша сім'я</Title>
        <Box>
          <Text>
            Безкінечна праця нашої команди та волонтерів створює серце та душу
            нашого притулку. Кожен член команди приносить унікальні навички та
            тепло свого серця, будуючи не просто притулок, але й справжню родину
            для наших безпритульних тварин.
          </Text>
          <SecondText>
            Наш успіх - це спільний результат. Ми вдячні нашим партнерам та
            активній спільноті, які разом з нами творять позитивні зміни в житті
            наших пухнастих друзів. Разом ми створюємо сім'ю, в якій кожен може
            знайти не лише прихисток, але і безмежну любов та турботу.
          </SecondText>
        </Box>
      </Container>
    </Section>
  );
};

export default AboutUsFamily;
