import {
  Button,
  Container,
  Image,
  LastText,
  Section,
  Text,
  Title,
} from './HomeFindFriend.styled';
import sprite from '../../images/sprite.svg'

const HomeFindFriend = () => {
  return (
    <Section>
      <Container>
        <Title>Знайди свого чотирилапого друга</Title>
        <Text>
          Любов безмежна, а найбільше вона сяє у тих митях, коли ти даруєш її
          іншій живій істоті. У нашому притулку ми віримо в те, що кожен має
          право на щасливе життя та відданого друга. Чекаючі на тебе – це
          безпритульні тварини, які готові до полноцінного життя у гарячо
          люблячому гніздечку.
        </Text>
        <Text>
          Запрошуємо тебе стати частиною цього чудового процесу – взяти додому
          нового друга, який готовий поділитися своєю радістю та вірністю. Наші
          підопічні готові стати членами твоєї родини, принести в дім радість та
          неповторні миті тепла.
        </Text>
        <LastText>
          Прийди та знайди того, кого ти чекаєш. Адопція – це не лише акт
          любові, але і шлях до створення незабутніх спогадів. Разом ми можемо
          змінити життя, один лагідний погляд та щира посмішка назавжди
          залишаться у твоїй душі.
        </LastText>
        <Button to="/adoption">Підібрати друга</Button>
        <Image>
          <use href={`${sprite}#icon-dog`}></use>
        </Image>
      </Container>
    </Section>
  );
};

export default HomeFindFriend;
